{
    "texts": [
        "Razer couldn’t resist the siren’s call of gaming chairs, it seems. The game hardware maker has unveiled its first gaming chair, the Iskur, and it’s not just the standard furniture with a green snake logo on the headrest. The company claims to have a unique external lumbar support system whose 26-degree customization is meant to improve your posture. It’s focused on alleviating the tension in the middle and lower portions of your spine. You can also expect foam cushions for extra comfort and support, a “4D” adjustable armrest and a memory foam-based neck pillow. The look is relatively restrained as far as gaming chairs go, with green stiching (and yes, that snake logo) on an otherwise subdued black synthetic leather. The chair is available now for $500 through Razer’s website. That’s a lot to pay if you’re used to picking up a nice-enough chair from the local office supply store, but it’s not outlandish compared to other gaming seats. It’s certainly more affordable than Logitech’s $1,495 Herman Miller-made Embody. As it is, the price may be easy to justify if you want to protect your back during hours-long gameplay sessions.",
        "For its very first gaming chair, it looks like Razer decided to largely copy one of today’s oft-cited favorites: the new $499 Razer Iskur is a dead ringer for the similarly-priced Secretlab Omega and Titan. You can compare the design, the recline mechanism, the stitching — heck, just look at those nigh-identical 4D armrests below — and the inspiration is plainly clear. And yet Razer explicitly tells The Verge it’s not a collaboration with Secretlab, saying the chair was “designed and developed in-house.” Perhaps they share a manufacturer, though? But Razer is also clearly pitching the Iskur as a step ahead of Secretlab in terms of spinal support, as you can see in this thinly veiled comparison image Aside from being a distinct hybrid of the Secretlab Omega’s smaller bucket seat and the Titan’s larger, more accommodating frame (the Iskur supports gamers up to nearly 300 pounds and 6.2 feet tall), the biggest differences here are a curvier back and the large adjustable lumbar support. It’s true that the Omega’s removable pillow and the Titan’s internal adjustable lumbar haven’t exactly gotten rave reviews. We’re curious if the Iskur’s jut-out-at-an-angle lumbar pad, which looks a bit like a snake’s belly, will be better. That said, plenty of gamers swear by Secretlab’s chairs for back support with or without the lumbar — mine was great for my back, but I sold it because of a sore butt. The Omega and Titan have another thing going for them, too: you can easily buy one that isn’t quite so garish and doesn’t come embroidered with a company’s trademarked slogan. The Iskur is available to preorder today at Razer’s website, with more retailers coming later this year. Secretlab makes some pretty good chairs; we’re looking forward to giving this competitor a try.",
        "Air Canada is still looking to take Transat AT under its wing despite the COVID-19 pandemic that has rocked the airline industry, but it will pay far less than originally expected. The two companies have agreed on revised terms that would see Air Canada pay $5 a share for the parent company of Air Transat, compared to the $18 per share originally pledged in its takeover bid. Read more: Coronavirus: Air Transat revenues drop by 99%, with 2,000 layoffs expected That brings the total price of the takeover to $190 million, down from $720 million previously. Air Canada says in a news release that the pandemic has had a devastating effect on the aviation industry and the value of airlines and their assets, but it still wants to proceed with the acquisition. The deal could be concluded in early 2021 if it is approved by Transat AT shareholders and regulators in Canada and the European Union. The European Commission’s antitrust body, which is investigating the proposed merger, has not indicated whether it would give the green light.",
        "MONTREAL - Air Canada is still looking to take Transat AT under its wing despite the COVID-19 pandemic that has rocked the airline industry, but it will pay far less than originally expected. The two companies announced Saturday they'd agreed on revised terms that would see Air Canada pay $5 a share for the parent company of Air Transat, compared to the $18 per share originally pledged in its takeover bid. That brings the total price of the takeover to $190 million, down from $720 million previously.  “This is the worst crisis since the founding of Transat 33 years ago, and with a second wave of the pandemic underway, the timing of an eventual recovery remains uncertain,” Transat President and CEO Jean-Marc Eustache said in a statement. “More than ever, having a national airline with the scale to weather current industry turbulence, which is expected to continue for several years, is in the best interests of our shareholders, customers, employees and other stakeholders.” The deal is endorsed by Transat's board of directors and would allow shareholders to be paid in either cash or Air Canada shares. It must be approved by two-thirds Transat's shareholders, who will vote in an extraordinary assembly in early December. On Saturday, the company did not indicate whether its major shareholders, which include Letko Brosseau, the Fonds de solidarite FTQ and Quebec's pension fund manger, the Caisse de Depot, supported the deal. The deal takes place under a vastly different set of circumstances than were in place when the shareholders of the Quebec-based tour operator voted in favour of the previous deal in 2019. The pandemic has grounded flights, while 14-day quarantine restrictions remain in place for anyone arriving in Canada internationally. Air Canada said in a news release that the pandemic has had a devastating effect on the aviation industry and the value of airlines and their assets, but it still wants to proceed with the acquisition “at a reduced price and on modified terms.” “This combination will provide stability for Transat's operations and its stakeholders and will position Air Canada, and indeed the Canadian aviation industry, to emerge more strongly as we enter the post-COVID-19 world,” Air Canada President and CEO Calin Rovinescu said in a statement. Before the pandemic, the transaction would have allowed the group to hold a 60 per cent share of the transatlantic market from Canada. Air Canada and Transat AT would overlap on certain sun destinations in addition to having a grip on air travel in Montreal. The deal could be concluded in early 2021 if it is approved by Transat AT shareholders and regulators in Canada and the European Union. The deadline to secure the regulatory approvals has been pushed from late December to Feb. 15. The European Commission's antitrust body, which is investigating the proposed merger, has not indicated whether it would give the green light. Air Canada also approved $250 million in increased borrowing by Transat pending the completion of the merger. The $5-per-share purchase price represents a 31.6 per cent premium over the stock's 20-day weighed average. Transat AT shares closed at $3.83 on Friday. The agreed-upon price is one that is reasonable for both parties, according to Karl Moore, a professor in McGill University's Desautels Faculty of Management, who said the deal would never have closed at the original $18 share price. “We can no longer refer to the conditions that prevailed before the health crisis,” Moore said in a phone interview. “The aviation industry is in the darkest period in its history.” Air Canada will have to pay Transat a $30 million break fee if it terminates the deal, while Transat will have to pay $10 million if it accepts a firm offer of $6 a share or better that is not matched by Air Canada."
    ]
}